// pages/pact/pact.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
      pi:{
        info:"欢迎你来到我的小程序世界，在这里，你能得到荣华富贵，但与之付出也是同等的代价，甚至更高，所以，你考虑好了，就把这条约给签了"
      },
      pc:{
        data:[
          {
            title:"游戏规则",
            son:[
              "吸取敌方的生命壮大自己，记住，生命只有一次，死了就死了，不会重来",
              "吸取敌方的生命壮大自己，记住，生命只有一次，死了就死了，不会重来",
              "吸取敌方的生命壮大自己，记住，生命只有一次，死了就死了，不会重来"]
          },
          {
            title:"择妻标准",
            son:[
              "贪图享乐的不能娶",
              "爱慕虚荣的不能娶",
              "对双方父母不孝顺的不能娶",
              "胡搅蛮缠泼辣这人不能娶",
              "不做家务懒惰成性的不能娶"
            ]
          }
        ]
      }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})